РасширениеГТС/Джитиис/InformationRegisters/РеестрДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеестрДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерДокументаИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаДокументаИБ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиРеестраДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

РасширениеГТС/Джитиис/CommonModules/РасчетСебестоимостиНДС/Ext/Module.bsl
&ИзменениеИКонтроль("ТекстИсправленныеДокументыНДС")
Функция асп_ТекстИсправленныеДокументыНДС()
	Возврат "	
	|ВЫБРАТЬ
	|	Реестр.СторнируемыйДокумент КАК ДокументИсточник,
	|	РеестрИсточника.ДатаДокументаИБ КАК ДатаДокументаИсточника,
	|	МАКСИМУМ(ВЫБОР КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПеремещенияПрошлогоПериода)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ИсправлениеПеремещения,
	|	ДД.Период,
	|	ДД.Регистратор
	|ПОМЕСТИТЬ ИсправленныеДокументыНДС
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Реестр.Ссылка = ДД.Регистратор
	|		И (НЕ Реестр.ДополнительнаяЗапись ИЛИ Реестр.ТипСсылки В (&ДокументыСДвумяОрганизациями))
	|		И Реестр.Ссылка <> НЕОПРЕДЕЛЕНО
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрИсточника
	|		ПО РеестрИсточника.Ссылка = Реестр.СторнируемыйДокумент
	|		И (НЕ РеестрИсточника.ДополнительнаяЗапись ИЛИ РеестрИсточника.ТипСсылки В (&ДокументыСДвумяОрганизациями))
	|		И РеестрИсточника.Ссылка <> НЕОПРЕДЕЛЕНО
	|ГДЕ
	|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
	|	И ДД.Сторно
	|	И ДД.ДокументИсточник <> ДД.Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Реестр.СторнируемыйДокумент,
	|	РеестрИсточника.ДатаДокументаИБ,
	|	ДД.Период,
	|	ДД.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
#Вставка
	|	ИсправленныеДокументы.Регистратор КАК Регистратор,
#КонецВставки
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	СУММА(ДД.Количество) КАК Знаменатель
	|ПОМЕСТИТЬ ЗнаменателиИсправленныхДокументовНДС
	|ИЗ
	|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументыНДС КАК ИсправленныеДокументы
	|		ПО ИсправленныеДокументы.ДокументИсточник = ДД.Регистратор
	|ГДЕ
	|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
	|	И ДД.Активность
	|	И ДД.Период < &НачалоПериода
	|	И ДД.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы)
	|	И НЕ ДД.Сторно
	|	И ДД.Количество <> 0
	|СГРУППИРОВАТЬ ПО
	#Вставка
	|	ИсправленныеДокументы.Регистратор,
	#КонецВставки
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС
	|ИНДЕКСИРОВАТЬ ПО
	#Вставка
	|	Регистратор,
	#КонецВставки
	|	Организация,
	|	Партия
	|";
КонецФункции

&ИзменениеИКонтроль("ВключитьИсключитьНДСВСтоимостьПродаж24")
Процедура асп_ВключитьИсключитьНДСВСтоимостьПродаж24(ПараметрыРасчета)

	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыРасчета, "ВТОборотыСтоимостьПартийНДС") Тогда
		Возврат;
	КонецЕсли;

	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ВключитьИсключитьНДСВСтоимостьПродаж24");

	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Продажи.Период КАК Период,
	|	Продажи.Регистратор КАК Регистратор,
	|	АналитикаПартнеров.Организация КАК Организация,
	|	Продажи.Партия КАК Партия,
	|	Продажи.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов КАК ВидЗапасов
	|ПОМЕСТИТЬ ДвиженияПродаж
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|		ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	|		ПО ИсправленныеДокументы.Регистратор = Продажи.Регистратор
	|
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И АналитикаПартнеров.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	И НЕ Продажи.Сторно
	// Исключаем сторно движения исправлений и корректировок прошлого периода.
	// Такие движения уже сформированы в процедуре СкорректироватьСтоимостьСторноДвиженийИсправленныхДокументов() Область ИсправлениеСебестоимостьТоваров
	|	И НЕ (НЕ ИсправленныеДокументы.ДатаСторнируемогоДокумента ЕСТЬ NULL
	|		И ИсправленныеДокументы.ДатаСторнируемогоДокумента < &НачалоПериода
	|		И Продажи.Сторно)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Организация,
	|	Партия,
	|	ВидДеятельностиНДС,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторыВыручки
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ДД
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партии.СлужебноеВидДвиженияПриход КАК СлужебноеВидДвиженияПриход,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	// Подразделение должно заполняться аналогично УчетНДСРФ.ПолучитьПартии
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеСписанияНДС,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.ЕстьДвиженияПоВыручке,
	|	Партии.РаспределениеПоВыбывшимТоварам,
	|
	|	МАКСИМУМ(Партии.Количество) КАК Количество,
	|	СУММА(Партии.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Партии.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И ЕСТЬNULL(НастройкиУчетаНДСПриУСН.ОсновноеНалогообложение, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН)
	|		ТОГДА
	|			-Партии.НДСРегл
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		 И ЕСТЬNULL(НастройкиУчетаНДСПриУСН.ОсновноеНалогообложение, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН)
	|		ТОГДА
	|			-Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И ЕСТЬNULL(НастройкиУчетаНДСПриУСН.ОсновноеНалогообложение, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН)
	|		ТОГДА
	|			-Партии.НДСУпр
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		 И ЕСТЬNULL(НастройкиУчетаНДСПриУСН.ОсновноеНалогообложение, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН)
	|		ТОГДА
	|			-Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСУпр,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДСУпр,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|			ТОГДА Партии.СтоимостьБезНДС + Партии.НДСРегл
	|		КОГДА Партии.СтоимостьБезНДС = 0
	|			ТОГДА Партии.НДСРегл
	|		ИНАЧЕ Партии.СтоимостьБезНДС КОНЕЦ) КАК Стоимость
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.СлужебноеВидДвиженияПриход,
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов,
	|		ВЫБОР КОГДА Партии.СлужебноеВидДвиженияПриход
	|			ТОГДА Партии.КорВидДеятельностиНДС
	|			ИНАЧЕ Партии.ВидДеятельностиНДС
	|		КОНЕЦ КАК НалогообложениеПартии,
	|		ВЫБОР КОГДА Партии.СлужебноеВидДвиженияПриход
	|			ТОГДА Партии.ВидДеятельностиНДС
	|			ИНАЧЕ Партии.КорВидДеятельностиНДС
	|		КОНЕЦ КАК НалогообложениеНДС,
	|		Партии.ДокументПоступления КАК ДокументПоступления,
	|		Партии.СтоимостьБезНДСРегл КАК СтоимостьБезНДС,
	|		Партии.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|		Партии.НДСРегл КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.Количество,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		Партии.РазделУчета,
	|		(ВЫБОР
	|			КОГДА ДвиженияПродаж.Регистратор ЕСТЬ NULL ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Партии.Партия КОНЕЦ) КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		Партии.ВидДеятельностиНДС,
	|		Партии.АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов,
	|		ВЫБОР КОГДА Регистраторы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК ЕстьДвиженияПоВыручке,
	|		(ВЫБОР
	|			КОГДА Партии.ТипЗаписи В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		ВТОборотыСтоимостьПартийНДС КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРегистраторыВыручки КАК Регистраторы
	|			ПО Регистраторы.Регистратор = Партии.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияПродаж КАК ДвиженияПродаж
	|		 ПО ДвиженияПродаж.Период = Партии.Период
	|		 И ДвиженияПродаж.Регистратор = Партии.Регистратор
	|		 И ДвиженияПродаж.Организация = Партии.Организация
	|		 И ДвиженияПродаж.Партия = Партии.Партия
	|		 И ДвиженияПродаж.ВидДеятельностиНДС = Партии.ВидДеятельностиНДС
	|		 И ДвиженияПродаж.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатуры
	|		 И ДвиженияПродаж.ВидЗапасов = Партии.ВидЗапасов
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И Партии.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|		И (НЕ Партии.СлужебноеВидДвиженияПриход
	|			ИЛИ Партии.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов))
#Вставка
	|		И НЕ Партии.Сторно  
#КонецВставки
	|	
	|	) КАК Партии
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|	ПО
	|		ДанныеПервичныхДокументов.Организация = Партии.Организация
	|		И ДанныеПервичныхДокументов.Документ = Партии.ДокументПоступления
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК УСН
	|		ПО УСН.Организация = Партии.Организация
	|		И УСН.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкиУчетаНДСПриУСН КАК НастройкиУчетаНДСПриУСН
	|		ПО НастройкиУчетаНДСПриУСН.Организация = УСН.Организация
	|ГДЕ
	|	Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	И (Партии.ЕстьДвиженияПоВыручке
	|		ИЛИ Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.СлужебноеВидДвиженияПриход,
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.ЕстьДвиженияПоВыручке,
	|	Партии.РаспределениеПоВыбывшимТоварам
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.НДСРегл <> 0
	|	ИЛИ Партии.НДСУпр <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ЛОЖЬ 							   КАК СлужебноеВидДвиженияПриход,
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК Регистратор,
	|	Продажи.Регистратор                КАК ДокументДвижения,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов                 КАК ВидЗапасов,
	|	Продажи.РазделУчета				   КАК РазделУчета,
	|	Продажи.Партия				   	   КАК Партия,
	|	Продажи.АналитикаУчетаПартий	   КАК АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС		   КАК ВидДеятельностиНДС,
	|
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	&ИдентификаторНеиспользуемойФинЗаписи КАК ИдентификаторФинЗаписи,
	|
	|	СУММА(Продажи.Количество) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК Трудозатраты,
	|	0 КАК ПостатейныеПостоянныеСНДС,
	|	0 КАК ПостатейныеПеременныеСНДС,
	|	0 КАК ПостатейныеПостоянныеБезНДС,
	|	0 КАК ПостатейныеПеременныеБезНДС,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ТрудозатратыРегл,
	|	0 КАК ПостатейныеПостоянныеРегл,
	|	0 КАК ПостатейныеПеременныеРегл,
	|	0 КАК СтоимостьУпр,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК ТрудозатратыУпр,
	|	0 КАК ПостатейныеПостоянныеУпр,
	|	0 КАК ПостатейныеПеременныеУпр,
	|
	|	СУММА(Продажи.Количество) КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = Продажи.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|			ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваров КАК Цены
	|			ПО Цены.Организация = АналитикаПартнеров.Организация
	|			И Цены.Партия = Продажи.Партия
	|			И Цены.АналитикаУчетаПартий = Продажи.АналитикаУчетаПартий
	|			И Цены.АналитикаФинансовогоУчета = Продажи.АналитикаФинансовогоУчета
	|			И Цены.ВидДеятельностиНДС = Продажи.ВидДеятельностиНДС
	|			И Цены.АналитикаУчетаНоменклатуры = Продажи.АналитикаУчетаНоменклатуры
	|			И Цены.ВидЗапасов = Продажи.ВидЗапасов
	|			И Цены.РазделУчета = Продажи.РазделУчета
	|
	|ГДЕ
	|	АналитикаПартнеров.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение,
	|	Продажи.ТипЗапасов,
	|	Продажи.ВидЗапасов,
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация,
	|	Продажи.РазделУчета,
	|	Продажи.Партия,
	|	Продажи.АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Продажи.Количество) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 								   КАК Порядок,
	|	Партии.СлужебноеВидДвиженияПриход  КАК СлужебноеВидДвиженияПриход,
	|	Партии.Период 					   КАК Период,
	|	Партии.Регистратор 				   КАК Регистратор,
	|	Партии.Регистратор 				   КАК ДокументДвижения,
	|	Партии.Организация 				   КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов 				   КАК ВидЗапасов,
	|	Партии.РазделУчета				   КАК РазделУчета,
	|	Партии.Партия				   	   КАК Партия,
	|	НЕОПРЕДЕЛЕНО	       			   КАК АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета   КАК АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС		   КАК ВидДеятельностиНДС,
	|
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК Менеджер,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиНоменклатуры,
	|	"""" КАК ИдентификаторФинЗаписи,
	|
	|	СУММА(ВЫБОР КОГДА Партии.Количество < 0 ТОГДА -Партии.Количество
	|		ИНАЧЕ Партии.Количество КОНЕЦ) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА 0
	|		ИНАЧЕ Партии.НДСРегл КОНЕЦ) КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК Трудозатраты,
	|	0 КАК ПостатейныеПостоянныеСНДС,
	|	0 КАК ПостатейныеПеременныеСНДС,
	|	0 КАК ПостатейныеПостоянныеБезНДС,
	|	0 КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА Партии.НДСРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыРегл,
	|	0 КАК ТрудозатратыРегл,
	|	0 КАК ПостатейныеПостоянныеРегл,
	|	0 КАК ПостатейныеПеременныеРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА 0
	|		ИНАЧЕ Партии.НДСУпр КОНЕЦ) КАК СтоимостьУпр,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА Партии.НДСУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыУпр,
	|	0 КАК ТрудозатратыУпр,
	|	0 КАК ПостатейныеПостоянныеУпр,
	|	0 КАК ПостатейныеПеременныеУпр,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.Стоимость <> 0
	|	И Партии.ЕстьДвиженияПоВыручке
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.СлужебноеВидДвиженияПриход,
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.НДСРегл) <> 0
	|	ИЛИ СУММА(Партии.НДСУпр) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	Партия,
	|	ВидДеятельностиНДС,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Порядок
	|";

	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, Менеджер, СлужебноеВидДвиженияПриход,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов,
	|Подразделение, АналитикаУчетаПоПартнерам,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов,
	|НаправлениеДеятельностиКонтрагента, НаправлениеДеятельностиНоменклатуры,
	|НалогообложениеНДС, ДокументДвижения, ИдентификаторФинЗаписи,
	|РазделУчета, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|Стоимость, СтоимостьБезНДС, Количество,
	|ДопРасходы, ДопРасходыБезНДС,
	|СтоимостьРегл, НДСРегл, НДСУпр, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
	|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");

	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов,
	|РазделУчета, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
	|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");

	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,,
	Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя);

	ЭтоПриходноеДвижение = Ложь;

	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	Пока Выборка.Следующий() Цикл

		Если Выборка.Порядок = 1 Тогда

			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			ЭтоПриходноеДвижение = Выборка.СлужебноеВидДвиженияПриход;

		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
			И СтрокаОстатка.Организация = Выборка.Организация
			И СтрокаОстатка.Партия = Выборка.Партия
			И СтрокаОстатка.ВидДеятельностиНДС = Выборка.ВидДеятельностиНДС
			И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
			И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
			И СтрокаОстатка.Количество > 0 Тогда

			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);

			РасчетСебестоимостиКорректировкаСтоимости.РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			ЗаписьРаспределения.СлужебноеВидДвиженияПриход = ЭтоПриходноеДвижение;

			РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ЗаписьРаспределения);

		КонецЕсли;

	КонецЦикла;

	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета);

	// Формируются движения по регистрам:
	// - ДвиженияНоменклатураДоходыРасходы
	РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета);

	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(
	ПараметрыРасчета,
	"ВтПартии, ДвиженияПродаж, ВтРегистраторыВыручки, ВтРегистраторы");

	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);

КонецПроцедуры
